Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchVoltageLineToLine Property
 Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchVoltageLineToLine { get; }
Public Shared ReadOnly Property MismatchVoltageLineToLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchVoltageLineToLine {
	FailureDefinitionId^ get ();
}
static member MismatchVoltageLineToLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace